In [1]:
import numpy as np
import pandas as pd

#### Performing Arithmetic Operations on two or more dataframes

We can also perform simple arithmetic operations on two or more dataframes. Below are the stats for IPL 2018 and 2017.

In [6]:
# Teamwise stats for IPL 2018
IPL_2018 = pd.DataFrame({'IPL Team': ['CSK', 'SRH', 'KKR', 'RR', 'MI', 'RCB', 'KXIP', 'DD'],
                         'Matches Played': [16, 17, 16, 15, 14, 14, 14, 14],
                         'Matches Won': [11, 10, 9, 7, 6, 6, 6, 5]}
                       )
# Teamwise stats for IPL 2017
IPL_2017 = pd.DataFrame({'IPL Team': ['MI', 'RPS', 'KKR', 'SRH', 'KXIP', 'DD', 'GL', 'RCB'],
                         'Matches Played': [17, 16, 16, 15, 14, 14, 14, 14],
                         'Matches Won': [12, 10, 9, 8, 7, 6, 4, 3]}
                       )

In [7]:
IPL_2018.set_index('IPL Team', inplace=True)

In [8]:
IPL_2018

          Matches Played  Matches Won
IPL Team
CSK                   16           11
SRH                   17           10
KKR                   16            9
RR                    15            7
MI                    14            6
RCB                   14            6
KXIP                  14            6
DD                    14            5

In [9]:
IPL_2017.set_index('IPL Team', inplace=True)

In [10]:
IPL_2017

          Matches Played  Matches Won
IPL Team
MI                    17           12
RPS                   16           10
KKR                   16            9
SRH                   15            8
KXIP                  14            7
DD                    14            6
GL                    14            4
RCB                   14            3

In [11]:
# add the matches played and matches won using +
Total = IPL_2018 + IPL_2017

In [12]:
Total

          Matches Played  Matches Won
IPL Team
CSK                  NaN          NaN
DD                  28.0         11.0
GL                   NaN          NaN
KKR                 32.0         18.0
KXIP                28.0         13.0
MI                  31.0         18.0
RCB                 28.0          9.0
RPS                  NaN          NaN
RR                   NaN          NaN
SRH                 32.0         18.0

In [16]:
# add the matches played and matches won using add
Total = IPL_2018.add(IPL_2017, fill_value=0)
Total

          Matches Played  Matches Won
IPL Team
CSK                 16.0         11.0
DD                  28.0         11.0
GL                  14.0          4.0
KKR                 32.0         18.0
KXIP                28.0         13.0
MI                  31.0         18.0
RCB                 28.0          9.0
RPS                 16.0         10.0
RR                  15.0          7.0
SRH                 32.0         18.0

In [18]:
# win percentage? 
Total['Win Percentage'] = Total['Matches Won'] * 100 / Total['Matches Played']

In [19]:
Total

          Matches Played  Matches Won  Win Percentage
IPL Team
CSK                 16.0         11.0       68.750000
DD                  28.0         11.0       39.285714
GL                  14.0          4.0       28.571429
KKR                 32.0         18.0       56.250000
KXIP                28.0         13.0       46.428571
MI                  31.0         18.0       58.064516
RCB                 28.0          9.0       32.142857
RPS                 16.0         10.0       62.500000
RR                  15.0          7.0       46.666667
SRH                 32.0         18.0       56.250000

In [20]:
# Sorting to determine the teams with most number of wins. If the number of wins of two teams are the same, sort by the win percentage.
Total.sort_values(by = (['Matches Won', 'Win Percentage']), ascending = False)

          Matches Played  Matches Won  Win Percentage
IPL Team
MI                  31.0         18.0       58.064516
KKR                 32.0         18.0       56.250000
SRH                 32.0         18.0       56.250000
KXIP                28.0         13.0       46.428571
CSK                 16.0         11.0       68.750000
DD                  28.0         11.0       39.285714
RPS                 16.0         10.0       62.500000
RCB                 28.0          9.0       32.142857
RR                  15.0          7.0       46.666667
GL                  14.0          4.0       28.571429

In [49]:
df1 = pd.DataFrame({
    'City': ['New Delhi', 'Mumbai', 'Jalandhar', 'Nagpur'],
    'Temperature': [21, 14, 35, 36]
})

In [50]:
df1

        City  Temperature
0  New Delhi           21
1     Mumbai           14
2  Jalandhar           35
3     Nagpur           36

In [51]:
df2 = pd.DataFrame({
    'City': ['Mumbai', 'New Delhi', 'Trivandrum'],
    'Humidity': [68, 64, 67]
})

In [52]:
df2

         City  Humidity
0      Mumbai        68
1   New Delhi        64
2  Trivandrum        67

In [54]:
pd.merge(df1, df2, on='City', how='inner') #inner join

        City  Temperature  Humidity
0  New Delhi           21        64
1     Mumbai           14        68

### Inner join

In [55]:
pd.merge(df1, df2, on='City', how='inner') #result only contains common rows

        City  Temperature  Humidity
0  New Delhi           21        64
1     Mumbai           14        68

<img src="merge3.png" alt="Drawing" style="width: 500px;"/>

In [56]:
pd.merge(df1, df2, on='City', how = 'outer')

         City  Temperature  Humidity
0   New Delhi         21.0      64.0
1      Mumbai         14.0      68.0
2   Jalandhar         35.0       NaN
3      Nagpur         36.0       NaN
4  Trivandrum          NaN      67.0

### Outer join

<img src="merge4.png" alt="Drawing" style="width: 500px;"/>

In [57]:
pd.merge(df1, df2, on='City', how = 'left')

        City  Temperature  Humidity
0  New Delhi           21      64.0
1     Mumbai           14      68.0
2  Jalandhar           35       NaN
3     Nagpur           36       NaN

<img src="merge5.png" alt="Drawing" style="width: 500px;"/>

In [58]:
pd.merge(df1, df2, on='City', how = 'right')

         City  Temperature  Humidity
0   New Delhi         21.0        64
1      Mumbai         14.0        68
2  Trivandrum          NaN        67

<img src="merge6.png" alt="Drawing" style="width: 500px;"/>

In [59]:
pd.merge(df1, df2, on='City', how = 'outer')

         City  Temperature  Humidity
0   New Delhi         21.0      64.0
1      Mumbai         14.0      68.0
2   Jalandhar         35.0       NaN
3      Nagpur         36.0       NaN
4  Trivandrum          NaN      67.0

In [60]:
pd.merge(df1, df2, on='City', how = 'outer', indicator=True)

         City  Temperature  Humidity      _merge
0   New Delhi         21.0      64.0        both
1      Mumbai         14.0      68.0        both
2   Jalandhar         35.0       NaN   left_only
3      Nagpur         36.0       NaN   left_only
4  Trivandrum          NaN      67.0  right_only

What if you have a few overlapping columns in both? Except the on column?

In [61]:
df3 = pd.DataFrame({
    'City': ['New Delhi', 'Mumbai', 'Jalandhar', 'Nagpur'],
    'Temperature': [21, 14, 35, 27],
    'Humidity': [66, 67, 68, 69]
})

In [62]:
df3

        City  Temperature  Humidity
0  New Delhi           21        66
1     Mumbai           14        67
2  Jalandhar           35        68
3     Nagpur           27        69

In [63]:
df4 = pd.DataFrame({
    'City': ['Mumbai', 'New Delhi', 'Trivandrum'],
    'Humidity': [68, 64, 84],
    'Temperature': [23, 24, 25]
})

In [64]:
df4

         City  Humidity  Temperature
0      Mumbai        68           23
1   New Delhi        64           24
2  Trivandrum        84           25

In [65]:
pd.merge(df3, df4, on='City', how='inner')

        City  Temperature_x  Humidity_x  Humidity_y  Temperature_y
0  New Delhi             21          66          64             24
1     Mumbai             14          67          68             23

In [68]:
output = pd.merge(df3, df4, on='City', how='inner', suffixes=('_left', '_right'))

In [69]:
output

,City,Temperature_left,Humidity_left,Humidity_right,Temperature_right
0,New Delhi,21,66,64,24
1,Mumbai,14,67,68,23

In [80]:
def _max(row):
    col1 = row[1]
    col2 = row[4]
    return col1 if col1>col2 else col2

output['temperature'] = output.apply(_max, axis=1)

In [81]:
output

,City,Temperature_left,Humidity_left,Humidity_right,Temperature_right,temperature
0,New Delhi,21,66,64,24,24
1,Mumbai,14,67,68,23,23

In [82]:
output['Temperature'] = [row['Temperature_left'] if row['Temperature_left'] > row['Temperature_right'] else row['Temperature_right'] for index, row in output.iterrows()]

In [83]:
output['Temperature']

0    24
1    23
Name: Temperature, dtype: int64

In [73]:
print(list(output['Temperature_left'][output['Temperature_left']>output['Temperature_right']]))

[]

In [74]:
df5 = pd.DataFrame({
    'City': ['New Delhi', 'Mumbai', 'Jalandhar', 'Nagpur'],
    'Temperature': [21, 14, 35, 27]
})

In [75]:
df5

        City  Temperature
0  New Delhi           21
1     Mumbai           14
2  Jalandhar           35
3     Nagpur           27

In [76]:
df6 = pd.DataFrame({
    'Cities': ['Mumbai', 'New Delhi', 'Trivandrum'],
    'Humidity': [68, 64, 84]
})

In [77]:
df6

       Cities  Humidity
0      Mumbai        68
1   New Delhi        64
2  Trivandrum        84

In [78]:
pd.merge(df5, df6, left_on='City', right_on='Cities', how='inner')

        City  Temperature     Cities  Humidity
0  New Delhi           21  New Delhi        64
1     Mumbai           14     Mumbai        68

In [ ]:
bronze = pd.read_csv('Bronze.csv')

In [ ]:
gold = pd.read_csv('Gold.csv')

In [ ]:
bronze.head()

In [ ]:
gold.head()

In [ ]:
df5 = pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=('_bronze', '_gold'))

In [ ]:
df5.loc[df5['Country']=='India', :]

## Group by:

In [ ]:
animals = pd.DataFrame({'Animal' : ['Falcon', 'Falcon',
                               'Parrot', 'Parrot'],
                    'Max Speed' : [380., 370., 24., 26.]})

In [ ]:
animals_group = animals.groupby('Animal')

In [ ]:
animals_group

In [ ]:
for animal, animal_data in animals_group:
    print(animal)
    print(animal_data)

In [ ]:
animals_group.mean()

In [ ]:
animals_group.max()

In [ ]:
animals_group.min()

In [ ]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})

In [ ]:
grouped = df.groupby('A')

In [ ]:
for group, group_data in grouped:
    print(group)
    print(group_data)